###############################################################################
# Created by write_sdc
# Sat Jun 11 21:51:49 2022
###############################################################################
current_design mgmt_core_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clk -period 45.0000 [get_ports {core_clk}]
set_clock_transition 0.1500 [get_clocks {core_clk}]
set_clock_uncertainty 0.2500 core_clk
set_propagated_clock [get_clocks {core_clk}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {core_rstn}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_in}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_di}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_di}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_di}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_di}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_in_pad}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_ack_i}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[0]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[10]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[11]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[12]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[13]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[14]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[15]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[16]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[17]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[18]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[19]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[1]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[20]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[21]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[22]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[23]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[24]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[25]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[26]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[27]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[28]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[29]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[2]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[30]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[31]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[3]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[4]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[5]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[6]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[7]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[8]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_dat_i[9]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[0]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[1]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[2]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[3]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[4]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {irq[5]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[0]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[10]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[11]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[12]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[13]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[14]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[15]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[16]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[17]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[18]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[19]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[1]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[20]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[21]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[22]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[23]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[24]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[25]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[26]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[27]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[28]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[29]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[2]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[30]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[31]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[32]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[33]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[34]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[35]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[36]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[37]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[38]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[39]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[3]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[40]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[41]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[42]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[43]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[44]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[45]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[46]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[47]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[48]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[49]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[4]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[50]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[51]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[52]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[53]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[54]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[55]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[56]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[57]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[58]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[59]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[5]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[60]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[61]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[62]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[63]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[6]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[7]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[8]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_input[9]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_ack_i}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[0]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[10]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[11]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[12]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[13]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[14]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[15]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[16]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[17]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[18]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[19]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[1]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[20]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[21]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[22]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[23]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[24]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[25]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[26]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[27]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[28]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[29]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[2]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[30]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[31]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[3]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[4]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[5]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[6]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[7]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[8]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_i[9]}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {ser_rx}]
set_input_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdi}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_mode}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_oeb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {debug_out}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_clk}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_csb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_do}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io0_oeb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_do}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io1_oeb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_do}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io2_oeb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_do}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {flash_io3_oeb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_inenb_pad}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_mode0_pad}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_mode1_pad}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_out_pad}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {gpio_outenb_pad}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_cyc_o}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {hk_stb_o}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[10]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[11]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[12]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[13]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[14]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[15]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[16]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[17]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[18]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[19]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[20]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[21]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[22]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[23]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[24]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[25]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[26]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[27]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[28]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[29]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[30]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[31]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[32]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[33]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[34]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[35]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[36]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[37]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[38]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[39]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[40]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[41]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[42]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[43]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[44]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[45]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[46]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[47]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[48]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[49]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[4]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[50]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[51]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[52]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[53]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[54]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[55]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[56]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[57]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[58]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[59]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[5]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[60]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[61]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[62]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[63]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[6]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[7]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[8]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_iena[9]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[10]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[11]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[12]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[13]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[14]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[15]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[16]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[17]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[18]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[19]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[20]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[21]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[22]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[23]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[24]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[25]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[26]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[27]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[28]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[29]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[30]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[31]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[32]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[33]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[34]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[35]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[36]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[37]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[38]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[39]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[40]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[41]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[42]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[43]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[44]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[45]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[46]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[47]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[48]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[49]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[4]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[50]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[51]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[52]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[53]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[54]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[55]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[56]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[57]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[58]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[59]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[5]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[60]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[61]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[62]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[63]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[6]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[7]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[8]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_oenb[9]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[10]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[11]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[12]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[13]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[14]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[15]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[16]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[17]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[18]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[19]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[20]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[21]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[22]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[23]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[24]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[25]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[26]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[27]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[28]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[29]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[30]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[31]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[32]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[33]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[34]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[35]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[36]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[37]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[38]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[39]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[40]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[41]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[42]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[43]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[44]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[45]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[46]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[47]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[48]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[49]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[4]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[50]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[51]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[52]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[53]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[54]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[55]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[56]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[57]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[58]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[59]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[5]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[60]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[61]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[62]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[63]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[6]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[7]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[8]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {la_output[9]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[10]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[11]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[12]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[13]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[14]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[15]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[16]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[17]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[18]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[19]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[20]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[21]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[22]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[23]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[24]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[25]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[26]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[27]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[28]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[29]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[30]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[31]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[4]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[5]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[6]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[7]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[8]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_adr_o[9]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_cyc_o}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[10]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[11]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[12]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[13]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[14]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[15]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[16]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[17]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[18]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[19]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[20]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[21]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[22]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[23]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[24]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[25]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[26]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[27]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[28]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[29]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[30]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[31]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[4]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[5]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[6]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[7]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[8]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_dat_o[9]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[2]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_sel_o[3]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_stb_o}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_wb_iena}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {mprj_we_o}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {qspi_enabled}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {ser_tx}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_csb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_enabled}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sck}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdo}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {spi_sdoenb}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {trap}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {uart_enabled}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[0]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[1]}]
set_output_delay 9.0000 -clock [get_clocks {core_clk}] -add_delay [get_ports {user_irq_ena[2]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {debug_mode}]
set_load -pin_load 0.0729 [get_ports {debug_oeb}]
set_load -pin_load 0.0729 [get_ports {debug_out}]
set_load -pin_load 0.0729 [get_ports {flash_clk}]
set_load -pin_load 0.0729 [get_ports {flash_csb}]
set_load -pin_load 0.0729 [get_ports {flash_io0_do}]
set_load -pin_load 0.0729 [get_ports {flash_io0_oeb}]
set_load -pin_load 0.0729 [get_ports {flash_io1_do}]
set_load -pin_load 0.0729 [get_ports {flash_io1_oeb}]
set_load -pin_load 0.0729 [get_ports {flash_io2_do}]
set_load -pin_load 0.0729 [get_ports {flash_io2_oeb}]
set_load -pin_load 0.0729 [get_ports {flash_io3_do}]
set_load -pin_load 0.0729 [get_ports {flash_io3_oeb}]
set_load -pin_load 0.0729 [get_ports {gpio_inenb_pad}]
set_load -pin_load 0.0729 [get_ports {gpio_mode0_pad}]
set_load -pin_load 0.0729 [get_ports {gpio_mode1_pad}]
set_load -pin_load 0.0729 [get_ports {gpio_out_pad}]
set_load -pin_load 0.0729 [get_ports {gpio_outenb_pad}]
set_load -pin_load 0.0729 [get_ports {hk_cyc_o}]
set_load -pin_load 0.0729 [get_ports {hk_stb_o}]
set_load -pin_load 0.0729 [get_ports {mprj_cyc_o}]
set_load -pin_load 0.0729 [get_ports {mprj_stb_o}]
set_load -pin_load 0.0729 [get_ports {mprj_wb_iena}]
set_load -pin_load 0.0729 [get_ports {mprj_we_o}]
set_load -pin_load 0.0729 [get_ports {qspi_enabled}]
set_load -pin_load 0.0729 [get_ports {ser_tx}]
set_load -pin_load 0.0729 [get_ports {spi_csb}]
set_load -pin_load 0.0729 [get_ports {spi_enabled}]
set_load -pin_load 0.0729 [get_ports {spi_sck}]
set_load -pin_load 0.0729 [get_ports {spi_sdo}]
set_load -pin_load 0.0729 [get_ports {spi_sdoenb}]
set_load -pin_load 0.0729 [get_ports {trap}]
set_load -pin_load 0.0729 [get_ports {uart_enabled}]
set_load -pin_load 0.0729 [get_ports {la_iena[63]}]
set_load -pin_load 0.0729 [get_ports {la_iena[62]}]
set_load -pin_load 0.0729 [get_ports {la_iena[61]}]
set_load -pin_load 0.0729 [get_ports {la_iena[60]}]
set_load -pin_load 0.0729 [get_ports {la_iena[59]}]
set_load -pin_load 0.0729 [get_ports {la_iena[58]}]
set_load -pin_load 0.0729 [get_ports {la_iena[57]}]
set_load -pin_load 0.0729 [get_ports {la_iena[56]}]
set_load -pin_load 0.0729 [get_ports {la_iena[55]}]
set_load -pin_load 0.0729 [get_ports {la_iena[54]}]
set_load -pin_load 0.0729 [get_ports {la_iena[53]}]
set_load -pin_load 0.0729 [get_ports {la_iena[52]}]
set_load -pin_load 0.0729 [get_ports {la_iena[51]}]
set_load -pin_load 0.0729 [get_ports {la_iena[50]}]
set_load -pin_load 0.0729 [get_ports {la_iena[49]}]
set_load -pin_load 0.0729 [get_ports {la_iena[48]}]
set_load -pin_load 0.0729 [get_ports {la_iena[47]}]
set_load -pin_load 0.0729 [get_ports {la_iena[46]}]
set_load -pin_load 0.0729 [get_ports {la_iena[45]}]
set_load -pin_load 0.0729 [get_ports {la_iena[44]}]
set_load -pin_load 0.0729 [get_ports {la_iena[43]}]
set_load -pin_load 0.0729 [get_ports {la_iena[42]}]
set_load -pin_load 0.0729 [get_ports {la_iena[41]}]
set_load -pin_load 0.0729 [get_ports {la_iena[40]}]
set_load -pin_load 0.0729 [get_ports {la_iena[39]}]
set_load -pin_load 0.0729 [get_ports {la_iena[38]}]
set_load -pin_load 0.0729 [get_ports {la_iena[37]}]
set_load -pin_load 0.0729 [get_ports {la_iena[36]}]
set_load -pin_load 0.0729 [get_ports {la_iena[35]}]
set_load -pin_load 0.0729 [get_ports {la_iena[34]}]
set_load -pin_load 0.0729 [get_ports {la_iena[33]}]
set_load -pin_load 0.0729 [get_ports {la_iena[32]}]
set_load -pin_load 0.0729 [get_ports {la_iena[31]}]
set_load -pin_load 0.0729 [get_ports {la_iena[30]}]
set_load -pin_load 0.0729 [get_ports {la_iena[29]}]
set_load -pin_load 0.0729 [get_ports {la_iena[28]}]
set_load -pin_load 0.0729 [get_ports {la_iena[27]}]
set_load -pin_load 0.0729 [get_ports {la_iena[26]}]
set_load -pin_load 0.0729 [get_ports {la_iena[25]}]
set_load -pin_load 0.0729 [get_ports {la_iena[24]}]
set_load -pin_load 0.0729 [get_ports {la_iena[23]}]
set_load -pin_load 0.0729 [get_ports {la_iena[22]}]
set_load -pin_load 0.0729 [get_ports {la_iena[21]}]
set_load -pin_load 0.0729 [get_ports {la_iena[20]}]
set_load -pin_load 0.0729 [get_ports {la_iena[19]}]
set_load -pin_load 0.0729 [get_ports {la_iena[18]}]
set_load -pin_load 0.0729 [get_ports {la_iena[17]}]
set_load -pin_load 0.0729 [get_ports {la_iena[16]}]
set_load -pin_load 0.0729 [get_ports {la_iena[15]}]
set_load -pin_load 0.0729 [get_ports {la_iena[14]}]
set_load -pin_load 0.0729 [get_ports {la_iena[13]}]
set_load -pin_load 0.0729 [get_ports {la_iena[12]}]
set_load -pin_load 0.0729 [get_ports {la_iena[11]}]
set_load -pin_load 0.0729 [get_ports {la_iena[10]}]
set_load -pin_load 0.0729 [get_ports {la_iena[9]}]
set_load -pin_load 0.0729 [get_ports {la_iena[8]}]
set_load -pin_load 0.0729 [get_ports {la_iena[7]}]
set_load -pin_load 0.0729 [get_ports {la_iena[6]}]
set_load -pin_load 0.0729 [get_ports {la_iena[5]}]
set_load -pin_load 0.0729 [get_ports {la_iena[4]}]
set_load -pin_load 0.0729 [get_ports {la_iena[3]}]
set_load -pin_load 0.0729 [get_ports {la_iena[2]}]
set_load -pin_load 0.0729 [get_ports {la_iena[1]}]
set_load -pin_load 0.0729 [get_ports {la_iena[0]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[63]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[62]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[61]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[60]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[59]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[58]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[57]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[56]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[55]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[54]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[53]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[52]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[51]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[50]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[49]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[48]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[47]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[46]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[45]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[44]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[43]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[42]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[41]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[40]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[39]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[38]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[37]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[36]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[35]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[34]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[33]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[32]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[31]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[30]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[29]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[28]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[27]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[26]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[25]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[24]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[23]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[22]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[21]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[20]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[19]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[18]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[17]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[16]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[15]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[14]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[13]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[12]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[11]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[10]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[9]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[8]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[7]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[6]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[5]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[4]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[3]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[2]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[1]}]
set_load -pin_load 0.0729 [get_ports {la_oenb[0]}]
set_load -pin_load 0.0729 [get_ports {la_output[63]}]
set_load -pin_load 0.0729 [get_ports {la_output[62]}]
set_load -pin_load 0.0729 [get_ports {la_output[61]}]
set_load -pin_load 0.0729 [get_ports {la_output[60]}]
set_load -pin_load 0.0729 [get_ports {la_output[59]}]
set_load -pin_load 0.0729 [get_ports {la_output[58]}]
set_load -pin_load 0.0729 [get_ports {la_output[57]}]
set_load -pin_load 0.0729 [get_ports {la_output[56]}]
set_load -pin_load 0.0729 [get_ports {la_output[55]}]
set_load -pin_load 0.0729 [get_ports {la_output[54]}]
set_load -pin_load 0.0729 [get_ports {la_output[53]}]
set_load -pin_load 0.0729 [get_ports {la_output[52]}]
set_load -pin_load 0.0729 [get_ports {la_output[51]}]
set_load -pin_load 0.0729 [get_ports {la_output[50]}]
set_load -pin_load 0.0729 [get_ports {la_output[49]}]
set_load -pin_load 0.0729 [get_ports {la_output[48]}]
set_load -pin_load 0.0729 [get_ports {la_output[47]}]
set_load -pin_load 0.0729 [get_ports {la_output[46]}]
set_load -pin_load 0.0729 [get_ports {la_output[45]}]
set_load -pin_load 0.0729 [get_ports {la_output[44]}]
set_load -pin_load 0.0729 [get_ports {la_output[43]}]
set_load -pin_load 0.0729 [get_ports {la_output[42]}]
set_load -pin_load 0.0729 [get_ports {la_output[41]}]
set_load -pin_load 0.0729 [get_ports {la_output[40]}]
set_load -pin_load 0.0729 [get_ports {la_output[39]}]
set_load -pin_load 0.0729 [get_ports {la_output[38]}]
set_load -pin_load 0.0729 [get_ports {la_output[37]}]
set_load -pin_load 0.0729 [get_ports {la_output[36]}]
set_load -pin_load 0.0729 [get_ports {la_output[35]}]
set_load -pin_load 0.0729 [get_ports {la_output[34]}]
set_load -pin_load 0.0729 [get_ports {la_output[33]}]
set_load -pin_load 0.0729 [get_ports {la_output[32]}]
set_load -pin_load 0.0729 [get_ports {la_output[31]}]
set_load -pin_load 0.0729 [get_ports {la_output[30]}]
set_load -pin_load 0.0729 [get_ports {la_output[29]}]
set_load -pin_load 0.0729 [get_ports {la_output[28]}]
set_load -pin_load 0.0729 [get_ports {la_output[27]}]
set_load -pin_load 0.0729 [get_ports {la_output[26]}]
set_load -pin_load 0.0729 [get_ports {la_output[25]}]
set_load -pin_load 0.0729 [get_ports {la_output[24]}]
set_load -pin_load 0.0729 [get_ports {la_output[23]}]
set_load -pin_load 0.0729 [get_ports {la_output[22]}]
set_load -pin_load 0.0729 [get_ports {la_output[21]}]
set_load -pin_load 0.0729 [get_ports {la_output[20]}]
set_load -pin_load 0.0729 [get_ports {la_output[19]}]
set_load -pin_load 0.0729 [get_ports {la_output[18]}]
set_load -pin_load 0.0729 [get_ports {la_output[17]}]
set_load -pin_load 0.0729 [get_ports {la_output[16]}]
set_load -pin_load 0.0729 [get_ports {la_output[15]}]
set_load -pin_load 0.0729 [get_ports {la_output[14]}]
set_load -pin_load 0.0729 [get_ports {la_output[13]}]
set_load -pin_load 0.0729 [get_ports {la_output[12]}]
set_load -pin_load 0.0729 [get_ports {la_output[11]}]
set_load -pin_load 0.0729 [get_ports {la_output[10]}]
set_load -pin_load 0.0729 [get_ports {la_output[9]}]
set_load -pin_load 0.0729 [get_ports {la_output[8]}]
set_load -pin_load 0.0729 [get_ports {la_output[7]}]
set_load -pin_load 0.0729 [get_ports {la_output[6]}]
set_load -pin_load 0.0729 [get_ports {la_output[5]}]
set_load -pin_load 0.0729 [get_ports {la_output[4]}]
set_load -pin_load 0.0729 [get_ports {la_output[3]}]
set_load -pin_load 0.0729 [get_ports {la_output[2]}]
set_load -pin_load 0.0729 [get_ports {la_output[1]}]
set_load -pin_load 0.0729 [get_ports {la_output[0]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[31]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[30]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[29]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[28]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[27]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[26]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[25]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[24]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[23]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[22]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[21]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[20]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[19]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[18]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[17]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[16]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[15]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[14]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[13]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[12]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[11]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[10]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[9]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[8]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[7]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[6]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[5]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[4]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[3]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[2]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[1]}]
set_load -pin_load 0.0729 [get_ports {mprj_adr_o[0]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[31]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[30]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[29]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[28]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[27]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[26]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[25]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[24]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[23]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[22]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[21]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[20]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[19]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[18]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[17]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[16]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[15]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[14]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[13]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[12]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[11]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[10]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[9]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[8]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[7]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[6]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[5]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[4]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[3]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[2]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[1]}]
set_load -pin_load 0.0729 [get_ports {mprj_dat_o[0]}]
set_load -pin_load 0.0729 [get_ports {mprj_sel_o[3]}]
set_load -pin_load 0.0729 [get_ports {mprj_sel_o[2]}]
set_load -pin_load 0.0729 [get_ports {mprj_sel_o[1]}]
set_load -pin_load 0.0729 [get_ports {mprj_sel_o[0]}]
set_load -pin_load 0.0729 [get_ports {user_irq_ena[2]}]
set_load -pin_load 0.0729 [get_ports {user_irq_ena[1]}]
set_load -pin_load 0.0729 [get_ports {user_irq_ena[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_4 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core_clk}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {core_rstn}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_in}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io0_di}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io1_di}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io2_di}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {flash_io3_di}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in_pad}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_ack_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_ack_i}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ser_rx}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {spi_sdi}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hk_dat_i[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[63]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[62]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[61]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[60]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[59]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[58]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[57]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[56]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[55]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[54]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[53]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[52]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[51]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[50]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[49]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[48]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[47]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[46]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[45]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[44]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[43]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[42]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[41]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[40]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[39]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[38]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[37]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[36]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[35]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[34]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[33]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[32]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_input[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_dat_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 8.0000 [current_design]
